Repository: Senoue/amazon-ivs-broadcast-for-ios-demo
Catalog: Broadcasting/Localizable.xcstrings
Source language: en
Languages: ja

source: AWS Privacy Policy.
ja: AWSプライバシーポリシー

source: Create an Amazon IVS Channel.
ja: Amazon IVSチャンネルを作成する。

source: *Actual data usage may be higher or lower, depending on network conditions during the livestream.
ja: *実際のデータ使用量は、ライブ配信中のネットワーク状況により増減することがあります。

source: Actual data usage may be higher or lower, depending on network conditions during the livestream.
ja: 実際のデータ使用量は、ライブ配信中のネットワーク状況により増減することがあります。

source: Amazon IVS Broadcast Demo
ja: Amazon IVS 配信デモ

source: Auto
ja: 自動

source: Auto -
ja: 自動 -

source: Auto-adjust bitrate
ja: ビットレートを自動調整

source: Auto-configuration
ja: 自動設定

source: Auto-configuration chooses the best video settings for your current internet connection. You can always run this test again from the app settings.
ja: 自動設定は、現在のインターネット接続に最適な映像設定を選択します。このテストはアプリの設定からいつでも再実行できます。

source: Auto-orientation starts a stream in portrait or landscape mode depending on your device orientation.
ja: 自動向き設定では、デバイスの向きに応じて縦向きまたは横向きで配信を開始します。

source: Auto-orientation starts a stream in portrait or landscape mode depending on your device orientation. This setting cannot be changed during a stream.
ja: 自動向き設定では、デバイスの向きに応じて縦向きまたは横向きで配信を開始します。この設定は配信中に変更できません。

source: Automatically adjust the bitrate during a video stream. Turn on manually set bitrate limits to set the min and max bitrate.
ja: 配信中にビットレートを自動調整します。最小・最大ビットレートを指定するには「ビットレート制限を手動設定」をオンにしてください。

source: Automatically configure resolution, framerate, and bitrate based on current network conditions.
ja: 現在のネットワーク状況に基づいて、解像度・フレームレート・ビットレートを自動設定します。

source: Back
ja: 戻る

source: Bitrate
ja: ビットレート

source: Bitrate, resolution, and framerate impact the quality of your video stream. Note that higher resolutions and framerates will require higher bitrates to avoid compression artifacts. The app will automatically adjust your bitrate based on network conditions.
ja: ビットレート・解像度・フレームレートは映像の品質に影響します。高い解像度やフレームレートでは、圧縮ノイズを避けるためにより高いビットレートが必要になります。ビットレートはネットワーク状況に応じて自動調整されます。

source: Camera Access
ja: カメラへのアクセス

source: Camera Off
ja: カメラオフ

source: Camera off
ja: カメラオフ

source: Camera on
ja: カメラオン

source: Cancel
ja: キャンセル

source: Cancel auto-configuration
ja: 自動設定をキャンセル

source: Close
ja: 閉じる

source: Configuration Summary
ja: 設定の概要

source: Connecting
ja: 接続中

source: Continue
ja: 続ける

source: Continue to App
ja: アプリへ進む

source: Copy
ja: コピー

source: Could not complete network test. Check your internet connection and try again.
ja: ネットワークテストを完了できませんでした。インターネット接続を確認して、もう一度お試しください。

source: Create an Amazon IVS channel to get an ingest server and stream key.
ja: Amazon IVSチャンネルを作成して、インジェストサーバーとストリームキーを取得してください。

source: Create an Amazon IVS channel to get an ingest server and stream key. These values must be set before you can start streaming.
ja: Amazon IVSチャンネルを作成して、インジェストサーバーとストリームキーを取得してください。配信を開始する前に、これらの値を設定する必要があります。

source: Default camera
ja: デフォルトカメラ

source: Developer mode
ja: 開発者モード

source: Don't reconnect
ja: 再接続しない

source: Done
ja: 完了

source: Enable developer mode to show video and network stats for debugging.
ja: 開発者モードを有効にすると、デバッグ用の映像・ネットワーク統計が表示されます。

source: End stream
ja: 配信終了

source: ERROR
ja: エラー

source: Estimated data use
ja: 推定データ使用量

source: Estimated data use*
ja: 推定データ使用量*

source: Flip
ja: 反転

source: Get Started
ja: はじめる

source: Hide debug info
ja: デバッグ情報を隠す

source: Hide this notice
ja: この通知を隠す

source: Ingest server
ja: インジェストサーバー

source: Ingest Server
ja: インジェストサーバー

source: Ingest server not set or invalid
ja: インジェストサーバーが未設定か無効です

source: Invalid input. Framerate must be a number.
ja: 入力が無効です。フレームレートは数値で入力してください。

source: Invalid input. Minimum bitrate must be a number.
ja: 入力が無効です。最小ビットレートは数値で入力してください。

source: Invalid input. Target bitrate must be a number.
ja: 入力が無効です。目標ビットレートは数値で入力してください。

source: Invalid input./n Maximum bitrate must be a number.
ja: 入力が無効です。最大ビットレートは数値で入力してください。

source: Invalid resolution format. Must be 'width x height' where width and height is a number
ja: 解像度の形式が無効です。「幅x高さ」の形式で、幅と高さは数値で入力してください

source: Invite to watch
ja: 視聴に招待

source: Keep your stream key secret. Anyone who has it can stream to your Amazon IVS channel.
ja: ストリームキーは秘密にしてください。キーを知っている人は誰でもあなたのAmazon IVSチャンネルに配信できます。

source: Landscape
ja: 横向き

source: Lets the demo capture audio using the camera
ja: マイクを使って音声を取得できるようにします

source: Lets the demo capture video using the camera
ja: カメラを使って映像を取得できるようにします

source: Manually set bitrate limits
ja: ビットレート制限を手動設定

source: MAXIMUM BITRATE
ja: 最大ビットレート

source: Microphone Access
ja: マイクへのアクセス

source: MINIMUM BITRATE
ja: 最小ビットレート

source: Mute
ja: ミュート

source: NETWORK ISSUE
ja: ネットワークの問題

source: Not set
ja: 未設定

source: Offline
ja: オフライン

source: Orientation
ja: 画面の向き

source: Orientation cannot be changed when using a custom resolution. Change the orientation by setting a different resolution.
ja: カスタム解像度の使用中は画面の向きを変更できません。別の解像度を設定して向きを変更してください。

source: Paste from clipboard
ja: クリップボードからペースト

source: Playback URL
ja: 再生URL

source: Portrait
ja: 縦向き

source: Reconnecting
ja: 再接続中

source: Reconnecting...
ja: 再接続中…

source: Resolution and framerate
ja: 解像度とフレームレート

source: Rerun auto-configuration
ja: 自動設定を再実行

source: Return to settings
ja: 設定に戻る

source: Run auto-config
ja: 自動設定を実行

source: Run auto-configuration
ja: 自動設定を実行

source: Settings
ja: 設定

source: Share screen
ja: 画面を共有

source: Show debug info
ja: デバッグ情報を表示

source: Skip this step
ja: この手順をスキップ

source: Square
ja: 正方形

source: Start
ja: 開始

source: Stop sharing
ja: 共有を停止

source: Stream key
ja: ストリームキー

source: Stream Key
ja: ストリームキー

source: SUCCESS
ja: 成功

source: TARGET BITRATE
ja: 目標ビットレート

source: Testing network...
ja: ネットワークをテスト中…

source: The camera is disabled while you are sharing your screen. Stop sharing to enable it again.
ja: 画面共有中はカメラが無効になります。共有を停止すると再び有効になります。

source: The connection to the server was lost. The app will automatically try to reconnect.
ja: サーバーへの接続が失われました。自動的に再接続を試みます。

source: The source framerate of your video stream. This cannot be changed during a stream.
ja: 映像ストリームのソースフレームレートです。配信中は変更できません。

source: The source resolution of your video stream. This cannot be changed during a stream.
ja: 映像ストリームのソース解像度です。配信中は変更できません。

source: The target bitrate (or initial bitrate) of the stream in Kbps. Must be a number between 1 and 8500.
ja: ストリームの目標（初期）ビットレート（Kbps）。1〜8500の数値で指定してください。

source: The test is taking longer than usual.
ja: テストに通常より時間がかかっています。

source: These are the recommended encoder settings based on current network conditions. You can edit these values manually in the App settings.
ja: 現在のネットワーク状況に基づく推奨エンコーダー設定です。これらの値はアプリの設定から手動で変更できます。

source: This application does not store any data captured from your phone.
ja: このアプリは、お使いのスマートフォンから取得したデータを保存しません。

source: This demo application broadcasts your iPhone’s camera or screen to an Amazon IVS Channel.
ja: このデモアプリは、iPhoneのカメラまたは画面をAmazon IVSチャンネルに配信します。

source: To continue, provide the following permissions
ja: 続行するには、以下の権限を許可してください

source: Type a resolution in width x height pixel format. Width and height must both be between 160 and 1920, and the total pixel count (width x height) must be under 2,072,600.
ja: 解像度を「幅x高さ」のピクセル形式で入力してください。幅と高さはそれぞれ160〜1920で、総ピクセル数（幅×高さ）は2,072,600未満である必要があります。

source: Type the number of frames per second (fps). Must be a whole number between 10 and 60.
ja: フレームレート（fps）を入力してください。10〜60の整数で指定します。

source: Unknown test result status!
ja: 不明なテスト結果ステータスです

source: Unmute
ja: ミュート解除

source: Use custom framerate
ja: カスタムフレームレートを使用

source: Use custom resolution
ja: カスタム解像度を使用

source: Video quality
ja: 画質

source: View source code
ja: ソースコードを見る

source: Your stream must be restarted
ja: 配信の再起動が必要です

source: Your stream will go offline for a few moments while screen sharing is started.
ja: 画面共有の開始中、配信は一時的にオフラインになります。
